In [1]:
import pandas as pd

In [ ]:
https://www.altcademy.com/blog/how-to-drop-null-values-in-pandas/

In [ ]:
https://www.geeksforgeeks.org/how-to-rename-columns-in-pandas-dataframe/
    
https://www.shiksha.com/online-courses/articles/renaming-columns-in-pandas/

In [ ]:
https://sparkbyexamples.com/pandas/pandas-change-column-data-type-dttype/

In [ ]:
https://www.geeksforgeeks.org/working-with-missing-data-in-pandas/
products['quantity'].fillna(0, inplace=True)

In [1]:
import pandas as pd
import numpy as np  
data = {
    'Name': ['Anna', 'Bob', 'Catherine', 'David', 'Emma'],
    'Age': [28, None, 34, 29, None],
    'Salary': [70000, 48000, np.nan, 54000, 65000]
}

df = pd.DataFrame(data)
print(df)

        Name   Age   Salary
0       Anna  28.0  70000.0
1        Bob   NaN  48000.0
2  Catherine  34.0      NaN
3      David  29.0  54000.0
4       Emma   NaN  65000.0

In [3]:
df1=df.isnull()
df1

    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False    True
3  False  False   False
4  False   True   False

In [4]:
df_no_null_rows = df.dropna()
df_no_null_rows

    Name   Age   Salary
0   Anna  28.0  70000.0
3  David  29.0  54000.0

In [5]:
# Drop columns with any null values
df_no_null_columns = df.dropna(axis=1)
df_no_null_columns

        Name
0       Anna
1        Bob
2  Catherine
3      David
4       Emma

In [6]:
# Drop rows where all values are null
df_no_all_null_rows = df.dropna(how='all')
df_no_all_null_rows

        Name   Age   Salary
0       Anna  28.0  70000.0
1        Bob   NaN  48000.0
2  Catherine  34.0      NaN
3      David  29.0  54000.0
4       Emma   NaN  65000.0

In [7]:
# Drop rows where 'Age' is null
df_no_null_age = df.dropna(subset=['Age'])
df_no_null_age

        Name   Age   Salary
0       Anna  28.0  70000.0
2  Catherine  34.0      NaN
3      David  29.0  54000.0